<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'يجب قبول حقل السمة.',
    'accepted_if' => 'يجب قبول حقل السمة عندما يكون قيمة اخرى.',
    'active_url' => ' صالحا URLيجب أن يكون حقل السمة عنوان .',
    'after' => 'يجب أن يكون حقل السمة تاريخًا بعد تاريخ.',
    'after_or_equal' => 'يجب أن يكون حقل السمة: تاريخًا بعد أو يساوي التاريخ.',
    'alpha' => 'يجب أن يحتوي حقل السمة على أحرف فقط.',
    'alpha_dash' => 'يجب أن يحتوي حقل السمة على أحرف وأرقام وشرطات وشرطات سفلية فقط.',
    'alpha_num' => 'يجب أن يحتوي حقل السمة على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون حقل السمة: مصفوفة.',
    'ascii' => 'يجب أن يحتوي حقل السمة: فقط على أحرف ورموز أبجدية رقمية أحادية البايت.',
    'before' => 'يجب أن يكون حقل السمة تاريخًا قبل التاريخ.',
    'before_or_equal' => 'يجب أن يكون حقل السمة: تاريخًا قبل أو يساوي تاريخ.',
    'between' => [
        'array' => 'min,max :يجب أن يحتوي حقل :السمة على عناصر بين .',
        'file' => 'min and max kilobytesو :يجب أن يحتوي حقل :السمة على عناصر بين ',
        'numeric' => 'min,max :يجب أن يحتوي حقل :السمة على عناصر بين .',
        'string' => 'min,max :يجب أن يحتوي حقل :السمة على عناصر بين ',
    ],
    'boolean' => 'يجب أن يكون حقل السمة: صحيحًا أو خطأ.',
    'can' => 'يحتوي الحقل:السمة على قيمة غير مصرح بها.',
    'confirmed' => 'تأكيد حقل السمة غير متطابق.',
    'current_password' => 'كلمة المرور غير صحيحة.',
    'date' => 'يجب أن يكون حقل السمة تاريخًا صالحًا.',
    'date_equals' => 'يجب أن يكون حقل السمة تاريخًا مساويًا لـ :التاريخ.',
    'date_format' => 'format:يجب أن يتطابق حقل :السمة مع التنسيق .',
    'decimal' => 'يجب أن يحتوي حقل :السمة على منازل عشرية.',
    'declined' => 'يجب رفض حقل :السمة.',
    'declined_if' => 'يجب قبول حقل السمة عندما يكون قيمة اخرى..',
    'different' => 'يجب أن يكون حقل السمة و:اخرين مختلفين.',
    'digits' => 'يجب أن يكون حقل السمة: أرقامًا أرقامًا.',
    'digits_between' => 'min and max:يجب أن يكون حقل السمة بين رقمين .',
    'dimensions' => 'يحتوي الحقل :السمة  على أبعاد صورة غير صالحة.',
    'distinct' => 'يحتوي الحقل :السمة على قيمة مكررة.',
    'doesnt_end_with' => 'يجب ألا ينتهي حقل :السمة بأحد القيم التالية::.',
    'doesnt_start_with' => 'يجب ألا يبدأ الحقل :السمة بأحد القيم التالية:القيمة.',
    'email' => 'يجب أن يكون حقل السمة عنوان بريد إلكتروني صالحًا.',
    'ends_with' => 'يجب أن ينتهي حقل السمة بواحد مما يلي: القيم.',
    'enum' => 'السمة المحددة غير صالحة.',
    'exists' => 'السمة المحددة غير صالحة.',
    'extensions' => 'يجب أن يحتوي حقل :السمة على أحد الامتدادات التالية: :القيمة.',
    'file' => 'يجب أن يكون حقل السمة ملفًا.',
    'filled' => 'يجب أن يحتوي حقل :السمة على قيمة.',
    'gt' => [
        'array' => 'يجب أن يحتوي الحقل :السمة على أكثر من عناصر :القيمة.',
        'file' => 'يجب أن يكون حقل السمة أكبر من القيمة بالكيلوبايت.',
        'numeric' => 'يجب أن يكون حقل :السمة أكبر من :القيمة.',
        'string' => 'يجب أن يكون حقل السمة أكبر من أحرف القيمة:.',
    ],
    'gte' => [
        'array' => 'يجب أن يحتوي حقل :السمة على عناصر :القيمة أو أكثر.',
        'file' => 'يجب أن يكون حقل السمة أكبر من أو يساوي القيمة بالكيلوبايت.',
        'numeric' => 'يجب أن يكون حقل السمة أكبر من القيمة أو يساويها.',
        'string' => 'يجب أن يكون حقل السمة أكبر من أو يساوي أحرف القيمة.',
    ],
    'hex_color' => 'يجب أن يكون حقل السمة: لونًا سداسيًا عشريًا صالحًا.',
    'image' => 'يجب أن يكون حقل السمة: صورة.',
    'in' => 'السمة المحددة غير صالحة.',
    'in_array' => 'يجب أن يكون حقل :السمة موجودًا في :اخرى.',
    'integer' => 'يجب أن يكون حقل السمة عددًا صحيحًا.',
    'ip' => ' صالحا IP يجب أن يكون حقل السمة عنوان .',
    'ipv4' => ' صالحا IPv4 يجب أن يكون حقل السمة عنوان .',
    'ipv6' => 'صالحا IPv6 يجب أن يكون حقل السمة عنوان .',
    'json' => 'صالحا JSONيجب أن يكون الحقل:السمة عبارة عن سلسلة  .',
    'lowercase' => 'يجب أن يكون حقل السمة: صغيرًا.',
    'lt' => [
        'array' => 'يجب أن يحتوي حقل :السمة على عناصر أقل من :القيمة.',
        'file' => 'يجب أن يكون حقل السمة أقل من القيمة بالكيلو بايت.',
        'numeric' => 'يجب أن يكون حقل :السمة أقل من :القيمة.',
        'string' => 'يجب أن يكون حقل :السمة أقل من :القيمة أحرف.',
    ],
    'lte' => [
        'array' => 'يجب ألا يحتوي حقل :السمة على أكثر من :عناصر القيمة.',
        'file' => 'يجب أن يكون حقل السمة أقل من أو يساوي القيمة بالكيلوبايت.',
        'numeric' => 'يجب أن يكون الحقل:السمة أقل من أو يساوي:القيمة.',
        'string' => 'يجب أن يكون حقل السمة أقل من أو يساوي أحرف القيمة.',
    ],
    'mac_address' => ' صالحا MAC يجب أن يكون حقل السمة عنوان .',
    'max' => [
        'array' => ' من العناصر max يجب ألا يحتوي حقل :السمة على أكثر من  .',
        'file' => 'يجب ألا يكون حقل السمة أكبر من الحد الأقصى للكيلوبايت.',
        'numeric' => 'يجب ألا يكون حقل السمة أكبر من الحد الأقصى.',
        'string' => 'يجب ألا يكون حقل السمة أكبر من الحد الأقصى لعدد الأحرف. ',
    ],
    'max_digits' => 'الارقام max يجب ألا يحتوي حقل :السمة على أكثر من : .',
    'mimes' => 'يجب أن يكون حقل السمة ملفًا من النوع: القيم.',
    'mimetypes' => 'يجب أن يكون حقل السمة ملفًا من النوع: القيم.',
    'min' => [
        'array' => 'على اللاقل min يجب أن يحتوي حقل:السمة على عناصر .',
        'file' => ' min kilobytes :يجب أن يكون حقل :السمة على الأقل ',
        'numeric' => 'يجب أن يكون حقل السمة: دقيقة على الأقل.',
        'string' => ' احرف min  يجب أن يحتوي حقل :السمة على الأقل على',
    ],
    'min_digits' => 'على اللاقل min يجب أن يحتوي حقل:السمة على عناصر ',
    'missing' => 'يجب أن يكون حقل السمة مفقودًا.',
    'missing_if' => 'يجب أن يكون حقل :السمة مفقودًا عندما يكون :اخرى هو :قيمة.',
    'missing_unless' => 'يجب أن يكون حقل :السمة مفقودًا ما لم يكن :اخرى هو :قيمة.',
    'missing_with' => 'يجب أن يكون حقل :السمة مفقودًا عند وجود :قيم.',
    'missing_with_all' => 'يجب أن يكون حقل :السمة مفقودًا عند وجود القيم:.',
    'multiple_of' => 'يجب أن يكون حقل السمة مضاعفًا للقيمة:.',
    'not_in' => 'السمة المحددة غير صالحة.',
    'not_regex' => 'تنسيق حقل السمة غير صالح.',
    'numeric' => 'يجب أن يكون حقل السمة رقمًا.',
    'password' => [
        'letters' => 'يجب أن يحتوي حقل :السمة على حرف واحد على الأقل.',
        'mixed' => 'يجب أن يحتوي حقل :السمة على حرف كبير واحد وحرف صغير واحد على الأقل.',
        'numbers' => 'يجب أن يحتوي حقل :السمة على رقم واحد على الأقل.',
        'symbols' => 'يجب أن يحتوي حقل :السمة على رمز واحد على الأقل.',
        'uncompromised' => 'ظهرت السمة المعطاة في تسرب البيانات. الرجاء اختيار سمة مختلفة.',
    ],
    'present' => 'يجب أن يكون حقل السمة موجودًا.',
    'present_if' => 'يجب أن يكون حقل :السمة موجودًا عندما يكون :اخرى هو :قيمة.',
    'present_unless' => 'يجب أن يكون حقل :السمة موجودًا ما لم يكن :اخرى هو :قيمة.',
    'present_with' => 'يجب أن يكون حقل السمة موجودًا عند وجود القيم :..',
    'present_with_all' => 'يجب أن يكون حقل السمة موجودًا عند وجود القيم.',
    'prohibited' => 'حقل :السمة محظور.',
    'prohibited_if' => 'يُحظر حقل السمة عندما تكون القيمة :اخرى.',
    'prohibited_unless' => 'حقل :السمة محظور ما لم يكن :اخرى موجودًا في :قيم.',
    'prohibits' => 'يمنع حقل :السمة :اخرى من التواجد.',
    'regex' => 'تنسيق حقل السمة غير صالح.',
    'required' => 'حقل السمة مطلوب.',
    'required_array_keys' => 'يجب أن يحتوي الحقل:السمة على إدخالات لـ: :قيم.',
    'required_if' => 'حقل :السمة مطلوب عندما يكون :اخرى هو :قيم.',
    'required_if_accepted' => 'حقل :السمة مطلوب عند قبول :اخرى.',
    'required_unless' => 'حقل :السمة مطلوب ما لم يكن :اخرى موجودًا في :قيم.',
    'required_with' => 'حقل :السمة مطلوب عند وجود :قيم.',
    'required_with_all' => 'حقل :السمة مطلوب عند وجود :قيم.',
    'required_without' => 'حقل السمة مطلوب عندما لا تكون القيم موجودة.',
    'required_without_all' => 'حقل :السمة مطلوب في حالة عدم وجود أي من :قيم.',
    'same' => 'يجب أن يتطابق حقل :السمة مع :اخرى.',
    'size' => [
        'array' => 'يجب أن يحتوي حقل :السمة على عناصر :حجم.',
        'file' => 'يجب أن يكون حقل السمة :حجم بالكيلوبايت.',
        'numeric' => 'يجب أن يكون حقل السمة :حجم.',
        'string' => 'يجب أن يتكون حقل السمة: من أحرف الحجم.',
    ],
    'starts_with' => 'يجب أن يبدأ حقل :السمة بأحد القيم التالية: :قيم.',
    'string' => 'يجب أن يكون حقل السمة: سلسلة.',
    'timezone' => 'يجب أن يكون حقل السمة منطقة زمنية صالحة.',
    'unique' => 'لقد تم بالفعل أخذ السمة:.',
    'uploaded' => 'فشل تحميل السمة:.',
    'uppercase' => 'يجب أن يكون حقل السمة: كبيرًا.',
    'url' => 'صالحا URLيجب أن يكون حقل السمة عنوان ',
    'ulid' => 'صالحا ULID أن يكون حقل السمة عنوان ',
    'uuid' => 'صالحا UUID أن يكون حقل السمة عنوان ',
    'Your account has been successfully confirmed' => 'تم تاكيد حسابك بنجاح',
    'Your account has already been confirmed' => 'حسابك مؤكد بالفعل',
    'The code has been sent to your email' => 'تم ارسال الرمز الى بريدك الإلكتروني',
    'The code is incorrect, please enter it again' => 'الرمز غير صحيح الرجاء ادخاله مرة اخرى ',
    'You are receiving this email because we received a password reset request for your account' => 'لقد تلقيت هذا البريد الإلكتروني لأننا تلقينا طلبًا لإعادة تعيين كلمة المرور لحسابك',
    'A 6-digit code has been sent to your account' => 'تم ارسال رمز مكون من 6  ارقام الى حسابك',
    'email not found' => 'البريد الالكتروني غير موجود',
    'This password reset code will expire in 60 minutes' => 'ستنتهي صلاحية رمز إعادة تعيين كلمة المرور هذه خلال 60 دقيقة',
    'This Verify email code will expire in 60 minutes' => 'ستنتهي صلاحية رمز تاكيدالبريد الالكتروني خلال 60 دقيقة',
    'This code was sent to verify the validity of your email' => 'تم إرسال هذا الرمز للتحقق من صحة بريدك الإلكتروني',
    'You can change your password now' => 'يمكنك تغيير كلمة المرور الان',
    'The password has been changed successfully' => 'تم تغيير كلمة المرور بنجاح',
    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
